Revit 2024 API
EdgeArrayArray.Append Method
Add the edge array to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Append(
	EdgeArray item
)
Visual Basic
Public Overridable Sub Append ( _
	item As EdgeArray _
)
Visual C++
public:
virtual void Append(
	EdgeArray^ item
)
Parameters
item
Type: Autodesk.Revit.DB.EdgeArray
The edge array to be added.
See Also
EdgeArrayArray Class
Autodesk.Revit.DB Namespace